[M_MinecartMischief MissionDefinition]
MissionName="Carrinho com Carinho"
MissionDescription="Você encontrou um dispositivo ECHO que explica detalhadamente que todos os minerais devem ser pulverizados na trituradora, localizada no final dos trilhos da mina. Se conseguir levar o carrinho de minérios até a trituradora, você descobrirá o que há dentro dela. "
TurnInDescription="Ninguém sabe ainda pra quê serve aqueles pedaços de rocha."
MissionSummary="Leve o carrinho até a trituradora da mina. "
MissionGiver="Carrinho das Cavernas Cáusticas"
MissionTurnInLocation="Cavernas Cáusticas"
TeaserText="Uma caverna misteriosa e um carrinho de extração de minérios abandonado. "

[M_MinecartMischief:ActivateCrusher MissionObjectiveDefinition]
ProgressMessage="Ative a trituradora"

[M_MinecartMischief:BringOreToEnd1 MissionObjectiveDefinition]
ProgressMessage="Empurre o carrinho até a trituradora"

[M_MinecartMischief:FindMineCart MissionObjectiveDefinition]
ProgressMessage="Encontre o carrinho"

[M_MinecartMischief:ObjSet_ActivateCrusher MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MinecartMischief:Objset_BringOreToEnd MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MinecartMischief:Objset_FindCart MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MinecartMischief:Objset_OpenDoor1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MinecartMischief:Objset_OpenDoor2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MinecartMischief:Objset_OpenDoor3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MinecartMischief:Objset_StartCart MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MinecartMischief:ObjSet_TakeEridium MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MinecartMischief:OpenDoor1 MissionObjectiveDefinition]
ProgressMessage="Abra a porta"

[M_MinecartMischief:OpenDoor2 MissionObjectiveDefinition]
ProgressMessage="Abra a porta"

[M_MinecartMischief:OpenDoor3 MissionObjectiveDefinition]
ProgressMessage="Abra a porta"

[M_MinecartMischief:StartMineCart MissionObjectiveDefinition]
ProgressMessage="Empurre o carrinho"

[M_MinecartMischief:TakeEridium MissionObjectiveDefinition]
ProgressMessage="Recolha o Eridium bruto"

[M_MinecartMischief:WaitForCrusher MissionObjectiveDefinition]
ProgressMessage="Aguarde os resultados da trituradora"

